/*
	2016年9月3日11:34:47
*/
# include <iostream>
using namespace std;

int main (void)
{
	int i, j;
	int a[3][4]={{0,1,2,3},{4,5,6,7},{8,9,10,11}};
	for(i = 0; i<3; ++i)
		for(j = 0; j<4; ++j)
			cout << "a["<<i<<"]["<<j<<"]:" << a[i][j] << endl;

	char ch[] = {'I',' ','l','o','v','e',' ','y','o','u','!','\0'};
	//字符数组有效字符为11个，当定义ch[12]时，编译器会自动加上'\0'
	//而当定义为ch[]时，就需要人为加上'\0'
	cout << ch;//利用数组名ch和结束符'\0'直接输出，不再需要for循环
	cout <<endl;

	char ch1[]="I love you!";//字符串数组更方便
	cout << ch1 << endl;

	char ch2[12] = "12345678912";	//切记，字符串初始化时默认的'\0'也会占一个位置，所以写成123456789123时会越界
	cout << "请输入您要输入字符串(长度为12以内):\n";
//	cin >> ch2;//不能识别没越界的空格字符，自行认为是结束标志。也而不能识别月结字符
//	gets(ch2);//可以识别没越界的空格也是字符，但不能识别越界的字符
//	cin.get(ch2,12,'1');
	//格式为cin.get(参数1，参数2，参数3);参数1数组名，参数2为数组长度，参数3为结束标志
	//若不写参数3则默认结束（停止录入内存）标志为enter换行符
	//可以识别没有越界的空格字符，越界的字符元素不进行写入内存符操作,
	//而且数组有效元素个数为数组长度减1（即最后一个默认为'\0'）
	cout << "您输入的字符串为:" << ch2 << endl;

	return 0;
}