/**********************************************
 * ①默认拷贝构造器与拷贝构造器重载：
 *  子类没有实现拷贝构造器时，默认调用父类的拷贝构造器(无论父类中自实现与否)
 *  子类一旦实现拷贝构造器，必须调用自己的拷贝构造器，并且也会调用父类拷贝构造器
 *  毕竟子类复制构造器需要调用父类复制构造器进行初始化
 *②默认赋值运算重载与自实现赋值运算重载：
 *  子类当中未实现复制重载时，会调用父类的复制重载(无论父类中自实现与否)
 *  子类一旦自实现赋值运算赋重载，就不会再自动调用父类赋值运算符重载，
 *  除非在子类赋值运算赋重在时，程序中初始化中调用父类重载赋值运算符的函数
*******************************************************/
#include <iostream>
#include "student.h"
#include "graduate.h"
using namespace std;

int main()
{
    cout<<"---------------------"<<endl;
    Student kang("Mr.Kang", 21, 350);
    kang.dis();

    cout<<"---------------------"<<endl;
    Graduate Yuan("Miss.Yuan", 21, 410, 10000);
    Yuan.print();

    cout<<"---------------------"<<endl;
    Graduate Liu(Yuan);
    Liu.print();

    cout<<"---------------------"<<endl;
    Graduate Huang("Miss.Huang", 20, 410, 8000);
    Huang.print();
    Huang = Yuan;
    Huang.print();

    cout<<"---------------------"<<endl;
    return 0;
}

